hey @CameronHall I tried using this code internally and getting an error:

terraform plan shows everything is fine

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sentry_organization_member.john_doe will be created
  + resource "sentry_organization_member" "john_doe" {
      + email        = "ankush.goswami@test.com"
      + expired      = (known after apply)
      + id           = (known after apply)
      + member_id    = (known after apply)
      + organization = "Sentrytest"
      + pending      = (known after apply)
      + role         = "member"
      + teams        = [
          + "Test-Staging",
        ]
    }

But when i did apply i am getting an error, can you please point me to it. 

sentry_organization_member.john_doe: Creating...
╷
│ Error: sentry:
│
│   with sentry_organization_member.john_doe,
│   on main.tf line 10, in resource "sentry_organization_member" "john_doe":
│   10: resource "sentry_organization_member" "john_doe" {
│
╵